# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'ack'
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ctop'
brew 'ffmpeg'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'lsd'
brew 'libffi'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew 'tldr'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'z'

# Development
brew 'asdf'

# Apps
cask '1password'
cask 'alfred'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'helo'
cask 'karabiner-elements'
cask 'notion'
cask 'postman'
cask 'pastebot'
cask 'ray'
cask 'raycast'
cask 'readwise-ibooks'
cask 'rectangle'
cask 'screenflow'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmit'
cask 'tuple'
cask 'visual-studio-code'
cask 'warp'
cask 'whatsapp'
cask 'zoom'
cask 'zotero'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spring', id: 1508706541
mas 'Things', id: 904280696
mas 'Pages', id: 409201541
mas 'Bear Markdown Notes', id: 1091189122
